app/views/users/show.html.erb

SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = 3
---
<ul>
<% @user.followers.each do |follower| %>