app/controllers/callback_controller.rb

  def callback
    if Rails.env.development? || Rails.env.test?
      response = Instagram.get_access_token(params[:code],
    	  :redirect_uri => 'http://localhost:3000/callback')
    else
      response = Instagram.get_access_token(params[:code],
        :redirect_uri => 'http://who-instag.herokuapp.com/callback')
    end
    session[:access_token] = response.access_token

    # update user info with instagram user data

    client = Instagram.client(:access_token => session[:access_token])
    instag_user = client.user

    @user = current_user
    @user.username = instag_user.username
    @user.profile_name = instag_user.full_name
    @user.access_token = session[:access_token]
    @user.profile_picture = instag_user.profile_picture

    @user.save!
---
UPDATE "users" SET "username" = '#<Hashie::Mash bio="" counts=#<Hashie::Mash followed_by=3 follows=5 media=2> full_name="" id="188973886" profile_picture="http://images.instagram.com/profiles/anonymousUser.jpg" username="rdrgomes" website="">', "access_token" = '188973886.c0db224.6d15485cf7a4446e908d6e345df53815', "profile_picture" = 'http://images.instagram.com/profiles/anonymousUser.jpg', "updated_at" = '2012-11-30 01:22:42.473535' WHERE "users"."id" = 3

  def followers
    #follower loop
    client = Instagram.client(:access_token => session[:access_token])
    @user = current_user
    client.user_followed_by({:count => '999'}).each do |follower|
      #check if user has a follower
      if @user.has_follower(@user, follower) > 0 then
        @friend = @user.followers.find_by_username(follower.username)
        # set follower as a regular friend and update the last_change
        @friend.state = "friend"
        @friend.last_change = Time.now
        @friend.save!
      else
        # save new friend in followers list
        @user.followers.create(username: follower.username)
        @friend = @user.followers.find_by_username(follower.username)
        @friend.state = "new friend"
        @friend.last_change = Time.now
        @friend.save!
      end
    end

    # find unfollowed
    @user.followers.each do |follower|
---
SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = 3 AND "followers"."username" = 'rafaserejo' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."username" = 'rdrgomes' LIMIT 1
UPDATE "followers" SET "state" = 'new friend', "last_change" = '2012-11-30 12:46:32.530627', "updated_at" = '2012-11-30 12:46:32.531718' WHERE "followers"."id" = 3
INSERT INTO "followers" ("created_at", "last_change", "profile_picture", "state", "updated_at", "user_id", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "followers".* FROM "followers" WHERE "followers"."user_id" = 3