app/controllers/users_controller.rb

  def update
    @user = current_user

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
UPDATE "users" SET "username" = 'rdrgomes', "first_name" = 'Rodrigo', "profile_name" = 'rdrgomes', "last_name" = 'Gomes', "updated_at" = '2012-11-29 14:55:19.123639' WHERE "users"."id" = 2

  def destroy
    @user = current_user
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]